piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_rst_clk.h
/**
 *******************************************************************************
 * @file    MDR32F2xQI_rst_clk.h
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    22/05/2023
 * @brief   This file contains all the functions prototypes for the RST_CLK
 *          firmware library.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F2xQI_RST_CLK_H
#define __MDR32F2xQI_RST_CLK_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2xQI_config.h"

/** @addtogroup __MDR32F2xQI_StdPeriph_Driver MDR32F2xQI Standard Peripherial Driver
 * @{
 */

/** @addtogroup RST_CLK
 * @{
 */

/** @defgroup RST_CLK_Exported_Types RST_CLK Exported Types
 * @{
 */

/**
 * @brief Structure type for modules clocks frequencies expressed in Hz
 */
typedef struct
{
    uint32_t CPU_CLK_Frequency;
    uint32_t UART_Frequency[2];  // UART0 and UART1 frequencies after prescaler
    uint32_t TIMER_Frequency[2]; // TIMER0 and TIMER1 frequencies after prescaler
    uint32_t SSP_Frequency;      // SSP frequency after prescaler
    uint32_t ADC_Frequency;
    uint32_t ADCUI_Frequency;
    uint32_t RTCHSI_Frequency;
    uint32_t RTCHSE_Frequency;
} RST_CLK_Freq_TypeDef;

/**
 * @brief RST_CLK HSE (High Speed External) clock mode and source selection constants
 */
typedef enum {
    RST_CLK_HSE_OFF    = ((uint32_t)0x0),                                         /*!< Switch off HSE clock generator. */
    RST_CLK_HSE_ON     = RST_CLK_HS_CONTROL_HSE_ON,                               /*!< Switch on HSE clock generator. */
    RST_CLK_HSE_BYPASS = (RST_CLK_HS_CONTROL_HSE_ON | RST_CLK_HS_CONTROL_HSE_BYP) /*!< Use external clock source. */
} RST_CLK_HSE_Mode_TypeDef;

#define IS_RST_CLK_HSE(HSE) (((HSE) == RST_CLK_HSE_OFF) || \
                             ((HSE) == RST_CLK_HSE_ON) ||  \
                             ((HSE) == RST_CLK_HSE_BYPASS))

/**
 * @brief RST_CLK CPU_PLL clock mode and source selection constants
 */
typedef enum {
    RST_CLK_PLLCPU_SRC_HSI       = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI),
    RST_CLK_PLLCPU_SRC_HSI_DIV_2 = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSIdiv2),
    RST_CLK_PLLCPU_SRC_HSE       = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE),
    RST_CLK_PLLCPU_SRC_HSE_DIV_2 = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSEdiv2)
} RST_CLK_PLLCPU_Source_TypeDef;

#define IS_RST_CLK_PLLCPU_SOURCE(SRC) (((SRC) == RST_CLK_PLLCPU_SRC_HSI) ||       \
                                       ((SRC) == RST_CLK_PLLCPU_SRC_HSI_DIV_2) || \
                                       ((SRC) == RST_CLK_PLLCPU_SRC_HSE) ||       \
                                       ((SRC) == RST_CLK_PLLCPU_SRC_HSE_DIV_2))

/**
 * @brief RST_CLK CPU_C1 clock mode and source selection constants
 */
typedef enum {
    RST_CLK_CPU_C1_SRC_HSI       = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI),     /*!< HSI as CPU_C1 source. */
    RST_CLK_CPU_C1_SRC_HSI_DIV_2 = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSIdiv2), /*!< HSI/2 as CPU_C1 source. */
    RST_CLK_CPU_C1_SRC_HSE       = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE),     /*!< HSE as CPU_C1 source. */
    RST_CLK_CPU_C1_SRC_HSE_DIV_2 = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSEdiv2)  /*!< HSE/2 as CPU_C1 source. */
} RST_CLK_CPU_C1_Source_TypeDef;

#define IS_RST_CLK_CPU_C1_SOURCE(SRC) (((SRC) == RST_CLK_CPU_C1_SRC_HSI) ||       \
                                       ((SRC) == RST_CLK_CPU_C1_SRC_HSI_DIV_2) || \
                                       ((SRC) == RST_CLK_CPU_C1_SRC_HSE) ||       \
                                       ((SRC) == RST_CLK_CPU_C1_SRC_HSE_DIV_2))

/**
 * @brief RST_CLK PLL_CPU_MUL multiplier of the CPU_C1 clock constants
 */
typedef enum {
    RST_CLK_PLLCPU_MUL_1  = 0,
    RST_CLK_PLLCPU_MUL_2  = 1,
    RST_CLK_PLLCPU_MUL_3  = 2,
    RST_CLK_PLLCPU_MUL_4  = 3,
    RST_CLK_PLLCPU_MUL_5  = 4,
    RST_CLK_PLLCPU_MUL_6  = 5,
    RST_CLK_PLLCPU_MUL_7  = 6,
    RST_CLK_PLLCPU_MUL_8  = 7,
    RST_CLK_PLLCPU_MUL_9  = 8,
    RST_CLK_PLLCPU_MUL_10 = 9,
    RST_CLK_PLLCPU_MUL_11 = 10,
    RST_CLK_PLLCPU_MUL_12 = 11,
    RST_CLK_PLLCPU_MUL_13 = 12,
    RST_CLK_PLLCPU_MUL_14 = 13,
    RST_CLK_PLLCPU_MUL_15 = 14,
    RST_CLK_PLLCPU_MUL_16 = 15
} RST_CLK_PLLCPU_Multiplier_TypeDef;

#define IS_RST_CLK_PLLCPU_MUL(SRC) (((SRC) & ~0xFUL) == 0)

/**
 * @brief RST_CLK CPU_C2 clock source selection constants
 */
typedef enum {
    RST_CLK_CPU_C2_SRC_CPU_C1 = ((uint32_t)0x0 << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos), /*!< CPU_C1 as CPU_C2 source. */
    RST_CLK_CPU_C2_SRC_PLLCPU = ((uint32_t)0x1 << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos)  /*!< CPU_PLL as CPU_C2 source. */
} RST_CLK_CPU_C2_Source_TypeDef;

#define IS_RST_CLK_CPU_C2_SOURCE(SRC) (((SRC) == RST_CLK_CPU_C2_SRC_CPU_C1) || \
                                       ((SRC) == RST_CLK_CPU_C2_SRC_PLLCPU))

/**
 * @brief RST_CLK CPU_PLL output clock CPU_CLK_DIV divider constants
 */
typedef enum {
    RST_CLK_CPU_PRESCALER_DIV_1   = ((uint32_t)0x0 << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_2   = ((uint32_t)0x8 << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_4   = ((uint32_t)0x9 << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_8   = ((uint32_t)0xA << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_16  = ((uint32_t)0xB << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_32  = ((uint32_t)0xC << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_64  = ((uint32_t)0xD << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_128 = ((uint32_t)0xE << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_PRESCALER_DIV_256 = ((uint32_t)0xF << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos)
} RST_CLK_CPU_C3_Prescaler_TypeDef;

