piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_rst_clk.h
#define IS_RST_CLK_CPU_C3_DIV(DIV) (((DIV) == RST_CLK_CPU_PRESCALER_DIV_1) ||   \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_2) ||   \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_4) ||   \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_8) ||   \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_16) ||  \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_32) ||  \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_64) ||  \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_128) || \
                                    ((DIV) == RST_CLK_CPU_PRESCALER_DIV_256))

/**
 * @brief RST_CLK CPU_CLK source CPU_CLK selector constants
 */
typedef enum {
    RST_CLK_CPU_CLK_HSI    = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_HSI),
    RST_CLK_CPU_CLK_CPU_C3 = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3),
    RST_CLK_CPU_CLK_LSE    = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_LSE),
    RST_CLK_CPU_CLK_LSI    = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_LSI)
} RST_CLK_HCLK_Source_TypeDef;

#define IS_RST_CLK_HCLK_SOURCE(SRC) (((SRC) == RST_CLK_CPU_CLK_HSI) ||    \
                                     ((SRC) == RST_CLK_CPU_CLK_CPU_C3) || \
                                     ((SRC) == RST_CLK_CPU_CLK_LSE) ||    \
                                     ((SRC) == RST_CLK_CPU_CLK_LSI))

/**
 * @brief RST_CLK ADC_CLK source selector constants
 */
typedef enum {
    RST_CLK_ADC_CLK_CPU_C1  = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_CPU_C1),
    RST_CLK_ADC_CLK_PER1_C1 = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_PER1_C1),
    RST_CLK_ADC_CLK_PLLCPU  = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_PLLCPUo),
    RST_CLK_ADC_CLK_HSI_CLK = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_HSI_CLK)
} RST_CLK_ADC_Source_TypeDef;

#define IS_RST_CLK_ADC_CLK_SOURCE(SRC) (((SRC) == RST_CLK_ADC_CLK_CPU_C1) ||  \
                                        ((SRC) == RST_CLK_ADC_CLK_PER1_C1) || \
                                        ((SRC) == RST_CLK_ADC_CLK_PLLCPU) ||  \
                                        ((SRC) == RST_CLK_ADC_CLK_HSI_CLK))

/**
 * @brief RST_CLK ADC_C2_SEL output clock ADC_C3_SEL divider constants
 */
typedef enum {
    RST_CLK_ADC_PRESCALER_DIV_1   = ((uint32_t)0x0 << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_2   = ((uint32_t)0x8 << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_4   = ((uint32_t)0x9 << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_8   = ((uint32_t)0xA << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_16  = ((uint32_t)0xB << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_32  = ((uint32_t)0xC << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_64  = ((uint32_t)0xD << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_128 = ((uint32_t)0xE << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_256 = ((uint32_t)0xF << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos)
} RST_CLK_ADC_C3_Prescaler_TypeDef;

#define IS_RST_CLK_ADC_C3_DIV(DIV) (((DIV) == RST_CLK_ADC_PRESCALER_DIV_1) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_2) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_4) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_8) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_16) ||  \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_32) ||  \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_64) ||  \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_128) || \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_256))

/**
 * @brief RST_CLK ADCUI_CLK selector constants
 */
typedef enum {
    RST_CLK_ADCUI_CLK_CPU_C1  = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_CPU_C1),
    RST_CLK_ADCUI_CLK_PER1_C1 = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_PER1_C1),
    RST_CLK_ADCUI_CLK_PLLCPU  = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_PLLCPUo),
    RST_CLK_ADCUI_CLK_HSI_CLK = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_HSI_CLK)
} RST_CLK_ADCUI_Source_TypeDef;

#define IS_RST_CLK_ADCUI_CLK_SOURCE(SRC) (((SRC) == RST_CLK_ADCUI_CLK_CPU_C1) ||  \
                                          ((SRC) == RST_CLK_ADCUI_CLK_PER1_C1) || \
                                          ((SRC) == RST_CLK_ADCUI_CLK_PLLCPU) ||  \
                                          ((SRC) == RST_CLK_ADCUI_CLK_HSI_CLK))

/**
 * @brief RST_CLK ADCUI_CLK output clock ADCUI_CLK_DIV divider constants
 */
typedef enum {
    RST_CLK_ADCUI_PRESCALER_DIV_1   = ((uint32_t)0x0 << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_2   = ((uint32_t)0x8 << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_4   = ((uint32_t)0x9 << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_8   = ((uint32_t)0xA << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_16  = ((uint32_t)0xB << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_32  = ((uint32_t)0xC << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_64  = ((uint32_t)0xD << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_128 = ((uint32_t)0xE << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_256 = ((uint32_t)0xF << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos)
} RST_CLK_ADCUI_C3_Prescaler_TypeDef;

#define IS_RST_CLK_ADCUI_C3_DIV(DIV) (((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_1) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_2) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_4) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_8) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_16) ||  \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_32) ||  \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_64) ||  \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_128) || \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_256))

#define PCLK_BIT(BASE) ((uint32_t)(1 << ((((uint32_t)BASE) >> 15) & 0x1F)))

/**
 * @brief RST_CLK peripheral modules clock constants
 */
typedef enum {
    RST_CLK_PCLK_SSP     = PCLK_BIT(MDR_SSP_BASE),
    RST_CLK_PCLK_UART0   = PCLK_BIT(MDR_UART0_BASE),
    RST_CLK_PCLK_UART1   = PCLK_BIT(MDR_UART1_BASE),
    RST_CLK_PCLK_EEPROM  = PCLK_BIT(MDR_EEPROM_BASE),
    RST_CLK_PCLK_RST_CLK = PCLK_BIT(MDR_RST_CLK_BASE),
#if defined(USE_MDR32F21QI)
    RST_CLK_PCLK_DMA = PCLK_BIT(MDR_DMA_BASE),
    RST_CLK_PCLK_CRC = PCLK_BIT(MDR_CRC_BASE),
#endif
#if defined(USE_MDR32F23QI)
    RST_CLK_PCLK_I2C = PCLK_BIT(MDR_I2C_BASE),
    RST_CLK_PCLK_LCD = PCLK_BIT(MDR_LCD_BASE),
#endif
    RST_CLK_PCLK_ADC    = PCLK_BIT(MDR_ADC_BASE),
    RST_CLK_PCLK_WWDG   = PCLK_BIT(MDR_WWDG_BASE),
    RST_CLK_PCLK_IWDG   = PCLK_BIT(MDR_IWDG_BASE),
    RST_CLK_PCLK_POWER  = PCLK_BIT(MDR_POWER_BASE),
    RST_CLK_PCLK_BKP    = PCLK_BIT(MDR_BKP_BASE),
    RST_CLK_PCLK_ADCUI  = PCLK_BIT(MDR_ADCUI_BASE),
    RST_CLK_PCLK_TIMER0 = PCLK_BIT(MDR_TIMER0_BASE),
    RST_CLK_PCLK_TIMER1 = PCLK_BIT(MDR_TIMER1_BASE),
    RST_CLK_PCLK_PORTA  = PCLK_BIT(MDR_PORTA_BASE),
    RST_CLK_PCLK_PORTB  = PCLK_BIT(MDR_PORTB_BASE),
    RST_CLK_PCLK_PORTC  = PCLK_BIT(MDR_PORTC_BASE)
} RST_CLK_PCLK_TypeDef;

