piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_rst_clk.h
#if defined(USE_MDR32F21QI)
#define RST_CLK_PCLK_MASK (RST_CLK_PCLK_SSP | RST_CLK_PCLK_UART0 |     \
                           RST_CLK_PCLK_UART1 | RST_CLK_PCLK_EEPROM |  \
                           RST_CLK_PCLK_RST_CLK | RST_CLK_PCLK_PORTC | \
                           RST_CLK_PCLK_DMA | RST_CLK_PCLK_CRC |       \
                           RST_CLK_PCLK_ADC | RST_CLK_PCLK_WWDG |      \
                           RST_CLK_PCLK_IWDG | RST_CLK_PCLK_POWER |    \
                           RST_CLK_PCLK_BKP | RST_CLK_PCLK_ADCUI |     \
                           RST_CLK_PCLK_TIMER0 | RST_CLK_PCLK_TIMER1 | \
                           RST_CLK_PCLK_PORTA | RST_CLK_PCLK_PORTB)
#elif defined(USE_MDR32F23QI)
#define RST_CLK_PCLK_MASK (RST_CLK_PCLK_SSP | RST_CLK_PCLK_UART0 |     \
                           RST_CLK_PCLK_UART1 | RST_CLK_PCLK_EEPROM |  \
                           RST_CLK_PCLK_RST_CLK | RST_CLK_PCLK_PORTC | \
                           RST_CLK_PCLK_ADC | RST_CLK_PCLK_WWDG |      \
                           RST_CLK_PCLK_IWDG | RST_CLK_PCLK_POWER |    \
                           RST_CLK_PCLK_BKP | RST_CLK_PCLK_ADCUI |     \
                           RST_CLK_PCLK_TIMER0 | RST_CLK_PCLK_TIMER1 | \
                           RST_CLK_PCLK_PORTA | RST_CLK_PCLK_PORTB |   \
                           RST_CLK_PCLK_LCD | RST_CLK_PCLK_I2C)
#endif
#define IS_RST_CLK_PCLK(PCLK) (((PCLK)&RST_CLK_PCLK_MASK) == (PCLK))

/**
 * @brief RST_CLK PER1_C1 clock source constants
 */
typedef enum {
    RST_CLK_PER1_C1_CLK_SRC_LSI       = ((uint32_t)RST_CLK_PER1_CLOCK_C1_SEL_LSI),
    RST_CLK_PER1_C1_CLK_SRC_LSI_DIV_2 = ((uint32_t)RST_CLK_PER1_CLOCK_C1_SEL_LSIdiv2),
    RST_CLK_PER1_C1_CLK_SRC_LSE       = ((uint32_t)RST_CLK_PER1_CLOCK_C1_SEL_LSE),
    RST_CLK_PER1_C1_CLK_SRC_LSE_DIV_2 = ((uint32_t)RST_CLK_PER1_CLOCK_C1_SEL_LSEdiv2)
} RST_CLK_PER1_C1_TypeDef;

#define IS_RST_CLK_PER1_C1_CLK_SOURCE(SRC) (((SRC) == RST_CLK_PER1_C1_CLK_SRC_LSI) ||       \
                                            ((SRC) == RST_CLK_PER1_C1_CLK_SRC_LSI_DIV_2) || \
                                            ((SRC) == RST_CLK_PER1_C1_CLK_SRC_LSE) ||       \
                                            ((SRC) == RST_CLK_PER1_C1_CLK_SRC_LSE_DIV_2))

/**
 * @brief RST_CLK PER1_C2 clock source constants
 */
typedef enum {
    RST_CLK_PER1_C2_CLK_SRC_CPU_C1  = ((uint32_t)0x0),
    RST_CLK_PER1_C2_CLK_SRC_PER1_C1 = ((uint32_t)0x1),
    RST_CLK_PER1_C2_CLK_SRC_PLLCPU  = ((uint32_t)0x2),
    RST_CLK_PER1_C2_CLK_SRC_HSI_CLK = ((uint32_t)0x3)
} RST_CLK_PER1_C2_TypeDef;

#define IS_RST_CLK_PER1_C2_CLK_SOURCE(SRC) (((SRC) == RST_CLK_PER1_C2_CLK_SRC_CPU_C1) ||  \
                                            ((SRC) == RST_CLK_PER1_C2_CLK_SRC_PER1_C1) || \
                                            ((SRC) == RST_CLK_PER1_C2_CLK_SRC_PLLCPU) ||  \
                                            ((SRC) == RST_CLK_PER1_C2_CLK_SRC_HSI_CLK))

/**
 * @brief RST_CLK PER1 peripheral selection constants
 */
typedef enum {
    RST_CLK_PER1_C2_TIM0  = ((uint32_t)0x0),
    RST_CLK_PER1_C2_TIM1  = ((uint32_t)0x1),
    RST_CLK_PER1_C2_UART0 = ((uint32_t)0x2),
    RST_CLK_PER1_C2_UART1 = ((uint32_t)0x3),
    RST_CLK_PER1_C2_SSP   = ((uint32_t)0x4)
} RST_CLK_PER1_C2_X_TypeDef;

#define IS_RST_CLK_PER1_CLK(PER1_CLK) (((PER1_CLK) == RST_CLK_PER1_C2_TIM0) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_TIM1) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_UART0) || \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_UART1) || \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_SSP))

/**
 * @brief RST_CLK PER1_C2 divider constants
 */
typedef enum {
    RST_CLK_PER1_PRESCALER_DIV_1   = ((uint32_t)0x0),
    RST_CLK_PER1_PRESCALER_DIV_2   = ((uint32_t)0x1),
    RST_CLK_PER1_PRESCALER_DIV_4   = ((uint32_t)0x2),
    RST_CLK_PER1_PRESCALER_DIV_8   = ((uint32_t)0x3),
    RST_CLK_PER1_PRESCALER_DIV_16  = ((uint32_t)0x4),
    RST_CLK_PER1_PRESCALER_DIV_32  = ((uint32_t)0x5),
    RST_CLK_PER1_PRESCALER_DIV_64  = ((uint32_t)0x6),
    RST_CLK_PER1_PRESCALER_DIV_128 = ((uint32_t)0x7)
} RST_CLK_PER1_C2_Prescaler_TypeDef;

#define IS_RST_CLK_PER1_C2_DIV(DIV) (((DIV) == RST_CLK_PER1_PRESCALER_DIV_1) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_2) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_4) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_8) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_16) || \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_32) || \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_64) || \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_128))

/**
 * @brief RST_CLK flag identifiers
 */
typedef enum {
    RST_CLK_FLAG_HSERDY    = RST_CLK_CLOCK_STATUS_HSERDY,
    RST_CLK_FLAG_PLLCPURDY = RST_CLK_CLOCK_STATUS_PLLCPURDY
} RST_CLK_Flags_TypeDef;

#define IS_RST_CLK_FLAG(FLAG) (((FLAG) == RST_CLK_FLAG_HSERDY) || \
                               ((FLAG) == RST_CLK_FLAG_PLLCPURDY))

/**
 * @brief RST_CLK HSI clock HSI_C1_SEL divider constants
 */
typedef enum {
    RST_CLK_HSI_PRESCALER_DIV_1   = ((uint32_t)0x0 << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_2   = ((uint32_t)0x8 << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_4   = ((uint32_t)0x9 << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_8   = ((uint32_t)0xA << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_16  = ((uint32_t)0xB << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_32  = ((uint32_t)0xC << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_64  = ((uint32_t)0xD << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_128 = ((uint32_t)0xE << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_256 = ((uint32_t)0xF << RST_CLK_RTC_CLOCK_HSI_SEL_Pos)
} RST_CLK_HSI_C1_Prescaler_TypeDef;

#define IS_RST_CLK_HSI_CLK_DIV(DIV) (((DIV) == RST_CLK_HSI_PRESCALER_DIV_1) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_2) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_4) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_8) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_16) ||  \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_32) ||  \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_64) ||  \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_128) || \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_256))

/**
 * @brief RST_CLK HSE clock HSE_C1_SEL divider constants for RTCHSE
 */
typedef enum {
    RST_CLK_HSE_PRESCALER_DIV_1   = ((uint32_t)0x0 << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_2   = ((uint32_t)0x8 << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_4   = ((uint32_t)0x9 << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_8   = ((uint32_t)0xA << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_16  = ((uint32_t)0xB << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_32  = ((uint32_t)0xC << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_64  = ((uint32_t)0xD << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_128 = ((uint32_t)0xE << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_256 = ((uint32_t)0xF << RST_CLK_RTC_CLOCK_HSE_SEL_Pos)
} RST_CLK_HSE_C1_Prescaler_TypeDef;

